###############################################################################
# Created by write_sdc
# Sun May 29 00:08:20 2022
###############################################################################
current_design biquad
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a11[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a12[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b10[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b11[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b12[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nreset}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {yout[9]}]
set_load -pin_load 0.0334 [get_ports {yout[8]}]
set_load -pin_load 0.0334 [get_ports {yout[7]}]
set_load -pin_load 0.0334 [get_ports {yout[6]}]
set_load -pin_load 0.0334 [get_ports {yout[5]}]
set_load -pin_load 0.0334 [get_ports {yout[4]}]
set_load -pin_load 0.0334 [get_ports {yout[3]}]
set_load -pin_load 0.0334 [get_ports {yout[2]}]
set_load -pin_load 0.0334 [get_ports {yout[1]}]
set_load -pin_load 0.0334 [get_ports {yout[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nreset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a11[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a12[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b10[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b11[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b12[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
