###############################################################################
# Created by write_sdc
# Thu May 26 16:09:15 2022
###############################################################################
current_design coefio
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_i -period 10.0000 [get_ports {clk_i}]
set_clock_transition 0.1500 [get_clocks {clk_i}]
set_clock_uncertainty 0.2500 clk_i
set_propagated_clock [get_clocks {clk_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {adr_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {adr_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {adr_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {adr_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {cyc_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_i[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {rst_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {stb_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {we_i}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {x[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {y[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a11[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {a12[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {ack_o}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b10[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b11[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {b12[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_i}] -add_delay [get_ports {dat_o[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ack_o}]
set_load -pin_load 0.0334 [get_ports {a11[31]}]
set_load -pin_load 0.0334 [get_ports {a11[30]}]
set_load -pin_load 0.0334 [get_ports {a11[29]}]
set_load -pin_load 0.0334 [get_ports {a11[28]}]
set_load -pin_load 0.0334 [get_ports {a11[27]}]
set_load -pin_load 0.0334 [get_ports {a11[26]}]
set_load -pin_load 0.0334 [get_ports {a11[25]}]
set_load -pin_load 0.0334 [get_ports {a11[24]}]
set_load -pin_load 0.0334 [get_ports {a11[23]}]
set_load -pin_load 0.0334 [get_ports {a11[22]}]
set_load -pin_load 0.0334 [get_ports {a11[21]}]
set_load -pin_load 0.0334 [get_ports {a11[20]}]
set_load -pin_load 0.0334 [get_ports {a11[19]}]
set_load -pin_load 0.0334 [get_ports {a11[18]}]
set_load -pin_load 0.0334 [get_ports {a11[17]}]
set_load -pin_load 0.0334 [get_ports {a11[16]}]
set_load -pin_load 0.0334 [get_ports {a11[15]}]
set_load -pin_load 0.0334 [get_ports {a11[14]}]
set_load -pin_load 0.0334 [get_ports {a11[13]}]
set_load -pin_load 0.0334 [get_ports {a11[12]}]
set_load -pin_load 0.0334 [get_ports {a11[11]}]
set_load -pin_load 0.0334 [get_ports {a11[10]}]
set_load -pin_load 0.0334 [get_ports {a11[9]}]
set_load -pin_load 0.0334 [get_ports {a11[8]}]
set_load -pin_load 0.0334 [get_ports {a11[7]}]
set_load -pin_load 0.0334 [get_ports {a11[6]}]
set_load -pin_load 0.0334 [get_ports {a11[5]}]
set_load -pin_load 0.0334 [get_ports {a11[4]}]
set_load -pin_load 0.0334 [get_ports {a11[3]}]
set_load -pin_load 0.0334 [get_ports {a11[2]}]
set_load -pin_load 0.0334 [get_ports {a11[1]}]
set_load -pin_load 0.0334 [get_ports {a11[0]}]
set_load -pin_load 0.0334 [get_ports {a12[31]}]
set_load -pin_load 0.0334 [get_ports {a12[30]}]
set_load -pin_load 0.0334 [get_ports {a12[29]}]
set_load -pin_load 0.0334 [get_ports {a12[28]}]
set_load -pin_load 0.0334 [get_ports {a12[27]}]
set_load -pin_load 0.0334 [get_ports {a12[26]}]
set_load -pin_load 0.0334 [get_ports {a12[25]}]
set_load -pin_load 0.0334 [get_ports {a12[24]}]
set_load -pin_load 0.0334 [get_ports {a12[23]}]
set_load -pin_load 0.0334 [get_ports {a12[22]}]
set_load -pin_load 0.0334 [get_ports {a12[21]}]
set_load -pin_load 0.0334 [get_ports {a12[20]}]
set_load -pin_load 0.0334 [get_ports {a12[19]}]
set_load -pin_load 0.0334 [get_ports {a12[18]}]
set_load -pin_load 0.0334 [get_ports {a12[17]}]
set_load -pin_load 0.0334 [get_ports {a12[16]}]
set_load -pin_load 0.0334 [get_ports {a12[15]}]
set_load -pin_load 0.0334 [get_ports {a12[14]}]
set_load -pin_load 0.0334 [get_ports {a12[13]}]
set_load -pin_load 0.0334 [get_ports {a12[12]}]
set_load -pin_load 0.0334 [get_ports {a12[11]}]
set_load -pin_load 0.0334 [get_ports {a12[10]}]
set_load -pin_load 0.0334 [get_ports {a12[9]}]
set_load -pin_load 0.0334 [get_ports {a12[8]}]
set_load -pin_load 0.0334 [get_ports {a12[7]}]
set_load -pin_load 0.0334 [get_ports {a12[6]}]
set_load -pin_load 0.0334 [get_ports {a12[5]}]
set_load -pin_load 0.0334 [get_ports {a12[4]}]
set_load -pin_load 0.0334 [get_ports {a12[3]}]
set_load -pin_load 0.0334 [get_ports {a12[2]}]
set_load -pin_load 0.0334 [get_ports {a12[1]}]
set_load -pin_load 0.0334 [get_ports {a12[0]}]
set_load -pin_load 0.0334 [get_ports {b10[31]}]
set_load -pin_load 0.0334 [get_ports {b10[30]}]
set_load -pin_load 0.0334 [get_ports {b10[29]}]
set_load -pin_load 0.0334 [get_ports {b10[28]}]
set_load -pin_load 0.0334 [get_ports {b10[27]}]
set_load -pin_load 0.0334 [get_ports {b10[26]}]
set_load -pin_load 0.0334 [get_ports {b10[25]}]
set_load -pin_load 0.0334 [get_ports {b10[24]}]
set_load -pin_load 0.0334 [get_ports {b10[23]}]
set_load -pin_load 0.0334 [get_ports {b10[22]}]
set_load -pin_load 0.0334 [get_ports {b10[21]}]
set_load -pin_load 0.0334 [get_ports {b10[20]}]
set_load -pin_load 0.0334 [get_ports {b10[19]}]
set_load -pin_load 0.0334 [get_ports {b10[18]}]
set_load -pin_load 0.0334 [get_ports {b10[17]}]
set_load -pin_load 0.0334 [get_ports {b10[16]}]
set_load -pin_load 0.0334 [get_ports {b10[15]}]
set_load -pin_load 0.0334 [get_ports {b10[14]}]
set_load -pin_load 0.0334 [get_ports {b10[13]}]
set_load -pin_load 0.0334 [get_ports {b10[12]}]
set_load -pin_load 0.0334 [get_ports {b10[11]}]
set_load -pin_load 0.0334 [get_ports {b10[10]}]
set_load -pin_load 0.0334 [get_ports {b10[9]}]
set_load -pin_load 0.0334 [get_ports {b10[8]}]
set_load -pin_load 0.0334 [get_ports {b10[7]}]
set_load -pin_load 0.0334 [get_ports {b10[6]}]
set_load -pin_load 0.0334 [get_ports {b10[5]}]
set_load -pin_load 0.0334 [get_ports {b10[4]}]
set_load -pin_load 0.0334 [get_ports {b10[3]}]
set_load -pin_load 0.0334 [get_ports {b10[2]}]
set_load -pin_load 0.0334 [get_ports {b10[1]}]
set_load -pin_load 0.0334 [get_ports {b10[0]}]
set_load -pin_load 0.0334 [get_ports {b11[31]}]
set_load -pin_load 0.0334 [get_ports {b11[30]}]
set_load -pin_load 0.0334 [get_ports {b11[29]}]
set_load -pin_load 0.0334 [get_ports {b11[28]}]
set_load -pin_load 0.0334 [get_ports {b11[27]}]
set_load -pin_load 0.0334 [get_ports {b11[26]}]
set_load -pin_load 0.0334 [get_ports {b11[25]}]
set_load -pin_load 0.0334 [get_ports {b11[24]}]
set_load -pin_load 0.0334 [get_ports {b11[23]}]
set_load -pin_load 0.0334 [get_ports {b11[22]}]
set_load -pin_load 0.0334 [get_ports {b11[21]}]
set_load -pin_load 0.0334 [get_ports {b11[20]}]
set_load -pin_load 0.0334 [get_ports {b11[19]}]
set_load -pin_load 0.0334 [get_ports {b11[18]}]
set_load -pin_load 0.0334 [get_ports {b11[17]}]
set_load -pin_load 0.0334 [get_ports {b11[16]}]
set_load -pin_load 0.0334 [get_ports {b11[15]}]
set_load -pin_load 0.0334 [get_ports {b11[14]}]
set_load -pin_load 0.0334 [get_ports {b11[13]}]
set_load -pin_load 0.0334 [get_ports {b11[12]}]
set_load -pin_load 0.0334 [get_ports {b11[11]}]
set_load -pin_load 0.0334 [get_ports {b11[10]}]
set_load -pin_load 0.0334 [get_ports {b11[9]}]
set_load -pin_load 0.0334 [get_ports {b11[8]}]
set_load -pin_load 0.0334 [get_ports {b11[7]}]
set_load -pin_load 0.0334 [get_ports {b11[6]}]
set_load -pin_load 0.0334 [get_ports {b11[5]}]
set_load -pin_load 0.0334 [get_ports {b11[4]}]
set_load -pin_load 0.0334 [get_ports {b11[3]}]
set_load -pin_load 0.0334 [get_ports {b11[2]}]
set_load -pin_load 0.0334 [get_ports {b11[1]}]
set_load -pin_load 0.0334 [get_ports {b11[0]}]
set_load -pin_load 0.0334 [get_ports {b12[31]}]
set_load -pin_load 0.0334 [get_ports {b12[30]}]
set_load -pin_load 0.0334 [get_ports {b12[29]}]
set_load -pin_load 0.0334 [get_ports {b12[28]}]
set_load -pin_load 0.0334 [get_ports {b12[27]}]
set_load -pin_load 0.0334 [get_ports {b12[26]}]
set_load -pin_load 0.0334 [get_ports {b12[25]}]
set_load -pin_load 0.0334 [get_ports {b12[24]}]
set_load -pin_load 0.0334 [get_ports {b12[23]}]
set_load -pin_load 0.0334 [get_ports {b12[22]}]
set_load -pin_load 0.0334 [get_ports {b12[21]}]
set_load -pin_load 0.0334 [get_ports {b12[20]}]
set_load -pin_load 0.0334 [get_ports {b12[19]}]
set_load -pin_load 0.0334 [get_ports {b12[18]}]
set_load -pin_load 0.0334 [get_ports {b12[17]}]
set_load -pin_load 0.0334 [get_ports {b12[16]}]
set_load -pin_load 0.0334 [get_ports {b12[15]}]
set_load -pin_load 0.0334 [get_ports {b12[14]}]
set_load -pin_load 0.0334 [get_ports {b12[13]}]
set_load -pin_load 0.0334 [get_ports {b12[12]}]
set_load -pin_load 0.0334 [get_ports {b12[11]}]
set_load -pin_load 0.0334 [get_ports {b12[10]}]
set_load -pin_load 0.0334 [get_ports {b12[9]}]
set_load -pin_load 0.0334 [get_ports {b12[8]}]
set_load -pin_load 0.0334 [get_ports {b12[7]}]
set_load -pin_load 0.0334 [get_ports {b12[6]}]
set_load -pin_load 0.0334 [get_ports {b12[5]}]
set_load -pin_load 0.0334 [get_ports {b12[4]}]
set_load -pin_load 0.0334 [get_ports {b12[3]}]
set_load -pin_load 0.0334 [get_ports {b12[2]}]
set_load -pin_load 0.0334 [get_ports {b12[1]}]
set_load -pin_load 0.0334 [get_ports {b12[0]}]
set_load -pin_load 0.0334 [get_ports {dat_o[31]}]
set_load -pin_load 0.0334 [get_ports {dat_o[30]}]
set_load -pin_load 0.0334 [get_ports {dat_o[29]}]
set_load -pin_load 0.0334 [get_ports {dat_o[28]}]
set_load -pin_load 0.0334 [get_ports {dat_o[27]}]
set_load -pin_load 0.0334 [get_ports {dat_o[26]}]
set_load -pin_load 0.0334 [get_ports {dat_o[25]}]
set_load -pin_load 0.0334 [get_ports {dat_o[24]}]
set_load -pin_load 0.0334 [get_ports {dat_o[23]}]
set_load -pin_load 0.0334 [get_ports {dat_o[22]}]
set_load -pin_load 0.0334 [get_ports {dat_o[21]}]
set_load -pin_load 0.0334 [get_ports {dat_o[20]}]
set_load -pin_load 0.0334 [get_ports {dat_o[19]}]
set_load -pin_load 0.0334 [get_ports {dat_o[18]}]
set_load -pin_load 0.0334 [get_ports {dat_o[17]}]
set_load -pin_load 0.0334 [get_ports {dat_o[16]}]
set_load -pin_load 0.0334 [get_ports {dat_o[15]}]
set_load -pin_load 0.0334 [get_ports {dat_o[14]}]
set_load -pin_load 0.0334 [get_ports {dat_o[13]}]
set_load -pin_load 0.0334 [get_ports {dat_o[12]}]
set_load -pin_load 0.0334 [get_ports {dat_o[11]}]
set_load -pin_load 0.0334 [get_ports {dat_o[10]}]
set_load -pin_load 0.0334 [get_ports {dat_o[9]}]
set_load -pin_load 0.0334 [get_ports {dat_o[8]}]
set_load -pin_load 0.0334 [get_ports {dat_o[7]}]
set_load -pin_load 0.0334 [get_ports {dat_o[6]}]
set_load -pin_load 0.0334 [get_ports {dat_o[5]}]
set_load -pin_load 0.0334 [get_ports {dat_o[4]}]
set_load -pin_load 0.0334 [get_ports {dat_o[3]}]
set_load -pin_load 0.0334 [get_ports {dat_o[2]}]
set_load -pin_load 0.0334 [get_ports {dat_o[1]}]
set_load -pin_load 0.0334 [get_ports {dat_o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cyc_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {stb_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {we_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adr_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adr_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adr_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adr_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dat_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {y[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
