###############################################################################
# Created by write_sdc
# Sun May 29 23:31:07 2022
###############################################################################
current_design multa
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 20.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[0]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[10]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[11]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[12]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[13]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[14]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[1]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[2]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[3]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[4]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[5]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[6]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[7]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[8]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {a[9]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[0]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[10]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[11]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[12]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[13]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[14]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[15]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[16]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[17]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[18]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[1]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[2]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[3]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[4]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[5]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[6]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[7]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[8]}]
set_input_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b[9]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[0]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[10]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[11]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[12]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[13]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[14]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[15]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[16]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[17]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[18]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[19]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[1]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[20]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[21]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[22]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[23]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[24]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[25]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[26]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[27]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[28]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[29]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[2]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[30]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[31]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[32]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[33]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[3]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[4]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[5]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[6]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[7]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[8]}]
set_output_delay 4.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {r[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {r[33]}]
set_load -pin_load 0.0334 [get_ports {r[32]}]
set_load -pin_load 0.0334 [get_ports {r[31]}]
set_load -pin_load 0.0334 [get_ports {r[30]}]
set_load -pin_load 0.0334 [get_ports {r[29]}]
set_load -pin_load 0.0334 [get_ports {r[28]}]
set_load -pin_load 0.0334 [get_ports {r[27]}]
set_load -pin_load 0.0334 [get_ports {r[26]}]
set_load -pin_load 0.0334 [get_ports {r[25]}]
set_load -pin_load 0.0334 [get_ports {r[24]}]
set_load -pin_load 0.0334 [get_ports {r[23]}]
set_load -pin_load 0.0334 [get_ports {r[22]}]
set_load -pin_load 0.0334 [get_ports {r[21]}]
set_load -pin_load 0.0334 [get_ports {r[20]}]
set_load -pin_load 0.0334 [get_ports {r[19]}]
set_load -pin_load 0.0334 [get_ports {r[18]}]
set_load -pin_load 0.0334 [get_ports {r[17]}]
set_load -pin_load 0.0334 [get_ports {r[16]}]
set_load -pin_load 0.0334 [get_ports {r[15]}]
set_load -pin_load 0.0334 [get_ports {r[14]}]
set_load -pin_load 0.0334 [get_ports {r[13]}]
set_load -pin_load 0.0334 [get_ports {r[12]}]
set_load -pin_load 0.0334 [get_ports {r[11]}]
set_load -pin_load 0.0334 [get_ports {r[10]}]
set_load -pin_load 0.0334 [get_ports {r[9]}]
set_load -pin_load 0.0334 [get_ports {r[8]}]
set_load -pin_load 0.0334 [get_ports {r[7]}]
set_load -pin_load 0.0334 [get_ports {r[6]}]
set_load -pin_load 0.0334 [get_ports {r[5]}]
set_load -pin_load 0.0334 [get_ports {r[4]}]
set_load -pin_load 0.0334 [get_ports {r[3]}]
set_load -pin_load 0.0334 [get_ports {r[2]}]
set_load -pin_load 0.0334 [get_ports {r[1]}]
set_load -pin_load 0.0334 [get_ports {r[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
